<template>
  <div>
    <div class="page-wrapper">
      <div class="text-wrapper">
        <h1>О программе</h1>

        <h2>Что нового</h2>
        <p>Проект переразвернут с поддержкой <span class="text-accent">TypeScript</span>, а так же на основе <span class="text-accent">class-based</span> компонентов. Не знаю, какой стиль в компании, но решил как раз сделать в таком варианте - отличном от <span class="text-accent">bookMe</span>.</p>
        <p>Переработан дизайн макета, произведена адаптация под мобильные платформы, ну вернее собрано MobileLikeApp.</p>
        <p>Реализована динамическая догрузка отелей при прокрутке страницы.</p>
        <p>Данные подгружаются с jsonplaceholder.</p>
        <p>Для удобства проверки отправки заявки на бронь, добавлена кнопка "Заполнить форму".</p>

        <h2>Возможности программы</h2>
        <p>Ниже следует описание текущего функционала приложения:</p>
        <ul>
          <li>Список отелей для выбора;</li>
          <li>Переход на отдельную страницу отеля;</li>
          <li>Возможность отправить заявку на бронь;</li>
          <li>Список отправленных заявок (не сохраняются при перезагрузке).</li>
        </ul>

        <h2>Планируемый функционал</h2>
        <p>Что необходимо сделать далее:</p>
        <ul>
          <li>Просмотреть код, выполнить рефакторинг;</li>
          <li>Вынести стили из App.vue в отдельные файлы (по компонентам), слишком длинные - уже работать неудобно;</li>
          <li>Когда стили вынесутся в отдельные файлы - создать переменные для цветов;</li>
          <li>Форму заявки в модальном окне или на следующей странице - в цепочке после отеля;</li>
          <li>Рефакторинг состояния загрузки - сейчас индикатор загрузки размещен не совсем правильно, хотя визуально для пользователя это практически незаметно. Лучше выбрать для него фиксированное место, чтобы блоки не "прыгали".</li>
          <li>Добавить отель в Избранное;</li>
          <li>В нижних табах сделать активным активный таб;</li>
          <li>В нижних табах сделать иконки вместо текста;</li>
          <li>Сделать кнопку "Назад" на странице описания отеля;</li>
          <li>Оценить, какие блоки информации нужно вынести в отдельные vue-компоненты;</li>
          <li>Добавить выбор даты при заполнении заявки на бронирование;</li>
          <li>Переделать отображение заяяок в разделе "Текущие заявки" в список (как на Главной);</li>
          <li>В разделе "Текущие заявки" сделать возможным переход на Отель;</li>
          <li>Личный Кабинет с историей заявок.</li>
        </ul>

        <p class="text-muted">v.0.1.0</p>
      </div>
    </div>
  </div>
</template>
