<template>
  <div>
    <div class="text-wrapper">
      <h1>Что нового</h1>
      <p>Проект переразвернут с поддержкой TypeScript, а так же на основе class-based компонентов.</p>
      <p>Переработан дизайн макета, произведена адаптация под мобильные платформы.</p>
      <p>Реализована динамическая догрузка отелей при прокрутке страницы.</p>

      <h2>Возможности программы</h2>
      <p>Ниже следует описание текущего функционала приложения:</p>
      <ul>
        <li>Список отелей для выбора;</li>
        <li>Переход на отдельную страницу отеля;</li>
        <li>Возможность отправить заявку на бронь;</li>
        <li>Список отправленных заявок (не сохраняются при перезагрузке).</li>
      </ul>
    </div>
  </div>
</template>
