<template>
  <div>
    <div class="page-wrapper">
      <div class="text-wrapper">
        <h1>Что нового</h1>
        <p>Проект переразвернут с поддержкой TypeScript, а так же на основе class-based компонентов.</p>
        <p>Переработан дизайн макета, произведена адаптация под мобильные платформы.</p>
        <p>Реализована динамическая догрузка отелей при прокрутке страницы.</p>
        <p>Для удобства проверки отправки заявки на бронь, добавлена кнопка "Заполнить форму".</p>

        <h2>Возможности программы</h2>
        <p>Ниже следует описание текущего функционала приложения:</p>
        <ul>
          <li>Список отелей для выбора;</li>
          <li>Переход на отдельную страницу отеля;</li>
          <li>Возможность отправить заявку на бронь;</li>
          <li>Список отправленных заявок (не сохраняются при перезагрузке).</li>
        </ul>

        <h2>Планируемый функционал</h2>
        <p>Что необходимо сделать далее:</p>
        <ul>
          <li>Вынести стили из App.vue в отдельные файлы (по компонентам), слишком длинные - уже работать неудобно;</li>
          <li>Форму заявки в модальном окне или на следующей странице - в цепочке после отеля;</li>
          <li>Рефакторинг состояния загрузки - сейчас индикатор загрузки размещен не совсем правильно, хотя визуально для пользователя это не заменто никак. При росте проекта, скорее всего будет неудобно, но это не точно.</li>
          <li>Добавить отель в Избранное;</li>
          <li>Сделать кнопку "Назад" на странице описания отеля;</li>
          <li>Оценить, какие блоки информации нужно вынести в отдельные vue-компоненты;</li>
          <li>Добавить выбор даты при заполнении заявки на бронирование;</li>
          <li>Переделать отображение заяяок в разделе "Текущие заявки" в список (как на Главной);</li>
          <li>Личныйкабинет с историей заявок.</li>
        </ul>
      </div>
    </div>
  </div>
</template>
